; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	instrument5 - instrument
	instrument6 - instrument
	satellite3 - satellite
	instrument7 - instrument
	satellite4 - satellite
	instrument8 - instrument
	thermograph0 - mode
	infrared1 - mode
	Star4 - direction
	Star3 - direction
	Star1 - direction
	Star0 - direction
	GroundStation2 - direction
	Star5 - direction
	Star6 - direction
	Planet7 - direction
	Star8 - direction
	Planet9 - direction
	Phenomenon10 - direction
	Star11 - direction
	Phenomenon12 - direction
	Planet13 - direction
	Phenomenon14 - direction
)
(:init
	(supports instrument0 thermograph0)
	(supports instrument0 infrared1)
	(calibration_target instrument0 Star5)
	(supports instrument1 thermograph0)
	(supports instrument1 infrared1)
	(calibration_target instrument1 Star3)
	(calibration_target instrument1 Star1)
	(supports instrument2 thermograph0)
	(supports instrument2 infrared1)
	(calibration_target instrument2 Star5)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star4)
	(supports instrument3 infrared1)
	(supports instrument3 thermograph0)
	(calibration_target instrument3 GroundStation2)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star5)
	(supports instrument4 infrared1)
	(supports instrument4 thermograph0)
	(calibration_target instrument4 Star5)
	(calibration_target instrument4 GroundStation2)
	(supports instrument5 thermograph0)
	(supports instrument5 infrared1)
	(calibration_target instrument5 Star0)
	(calibration_target instrument5 Star1)
	(supports instrument6 thermograph0)
	(supports instrument6 infrared1)
	(calibration_target instrument6 Star5)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Planet9)
	(supports instrument7 infrared1)
	(calibration_target instrument7 Star0)
	(on_board instrument7 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Phenomenon14)
	(supports instrument8 thermograph0)
	(supports instrument8 infrared1)
	(calibration_target instrument8 Star5)
	(calibration_target instrument8 GroundStation2)
	(on_board instrument8 satellite4)
	(power_avail satellite4)
	(pointing satellite4 GroundStation2)
)
(:goal (and
	(pointing satellite1 Star6)
	(pointing satellite2 GroundStation2)
	(pointing satellite3 Star6)
	(pointing satellite4 Star5)
	(have_image Star6 infrared1)
	(have_image Planet7 thermograph0)
	(have_image Star8 infrared1)
	(have_image Planet9 thermograph0)
	(have_image Phenomenon10 infrared1)
	(have_image Star11 thermograph0)
	(have_image Phenomenon12 thermograph0)
	(have_image Planet13 thermograph0)
	(have_image Phenomenon14 infrared1)
))

)

; plan
1. (turn_to satellite3 star6 phenomenon14)
   deleted: (pointing satellite3 phenomenon14)
   added: (pointing satellite3 star6)
   goals met: 1 of 13
2. (turn_to satellite2 groundstation2 planet9)
   deleted: (pointing satellite2 planet9)
   added: (pointing satellite2 groundstation2)
   goals met: 2 of 13
3. (turn_to satellite1 groundstation2 star5)
   deleted: (pointing satellite1 star5)
   added: (pointing satellite1 groundstation2)
   goals met: 2 of 13
4. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 2 of 13
5. (calibrate satellite1 instrument3 groundstation2)
   added: (calibrated instrument3)
   goals met: 2 of 13
6. (turn_to satellite1 phenomenon14 groundstation2)
   deleted: (pointing satellite1 groundstation2)
   added: (pointing satellite1 phenomenon14)
   goals met: 2 of 13
7. (take_image satellite1 phenomenon14 instrument3 infrared1)
   added: (have_image phenomenon14 infrared1)
   goals met: 3 of 13
8. (turn_to satellite1 phenomenon12 phenomenon14)
   deleted: (pointing satellite1 phenomenon14)
   added: (pointing satellite1 phenomenon12)
   goals met: 3 of 13
9. (take_image satellite1 phenomenon12 instrument3 thermograph0)
   added: (have_image phenomenon12 thermograph0)
   goals met: 4 of 13
10. (turn_to satellite1 phenomenon10 phenomenon12)
   deleted: (pointing satellite1 phenomenon12)
   added: (pointing satellite1 phenomenon10)
   goals met: 4 of 13
11. (take_image satellite1 phenomenon10 instrument3 infrared1)
   added: (have_image phenomenon10 infrared1)
   goals met: 5 of 13
12. (turn_to satellite1 planet13 phenomenon10)
   deleted: (pointing satellite1 phenomenon10)
   added: (pointing satellite1 planet13)
   goals met: 5 of 13
13. (take_image satellite1 planet13 instrument3 thermograph0)
   added: (have_image planet13 thermograph0)
   goals met: 6 of 13
14. (turn_to satellite1 planet7 planet13)
   deleted: (pointing satellite1 planet13)
   added: (pointing satellite1 planet7)
   goals met: 6 of 13
15. (take_image satellite1 planet7 instrument3 thermograph0)
   added: (have_image planet7 thermograph0)
   goals met: 7 of 13
16. (turn_to satellite1 planet9 planet7)
   deleted: (pointing satellite1 planet7)
   added: (pointing satellite1 planet9)
   goals met: 7 of 13
17. (take_image satellite1 planet9 instrument3 thermograph0)
   added: (have_image planet9 thermograph0)
   goals met: 8 of 13
18. (turn_to satellite1 star11 planet9)
   deleted: (pointing satellite1 planet9)
   added: (pointing satellite1 star11)
   goals met: 8 of 13
19. (take_image satellite1 star11 instrument3 thermograph0)
   added: (have_image star11 thermograph0)
   goals met: 9 of 13
20. (turn_to satellite1 star8 star11)
   deleted: (pointing satellite1 star11)
   added: (pointing satellite1 star8)
   goals met: 9 of 13
21. (take_image satellite1 star8 instrument3 infrared1)
   added: (have_image star8 infrared1)
   goals met: 10 of 13
22. (turn_to satellite1 star6 star8)
   deleted: (pointing satellite1 star8)
   added: (pointing satellite1 star6)
   goals met: 11 of 13
23. (take_image satellite1 star6 instrument3 infrared1)
   added: (have_image star6 infrared1)
   goals met: 12 of 13
24. (turn_to satellite4 star5 groundstation2)
   deleted: (pointing satellite4 groundstation2)
   added: (pointing satellite4 star5)
   goals met: 13 of 13
